GHB2/src/InformationRegisters/гхб_НастройкиВозможностиРедактированияПарковочныеМеста/гхб_НастройкиВозможностиРедактированияПарковочныеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_НастройкиВозможностиРедактированияПарковочныеМеста</name>
  <attributes>
    <name>СлужебныеАвтомобили</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеАвтомобили</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипАвтомобиляСлужебныйПерсональный/гхб_ТипАвтомобиляСлужебныйПерсональный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипАвтомобиляСлужебныйПерсональный</name>
  <enumValues>
    <name>Персональный</name>
  </enumValues>
  <enumValues>
    <name>Служебный</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/InformationRegisters/гхб_НастройкиВозможностиРедактированияПарковочныеМеста/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает массив доступных типов автомобилей для указанного сотрудника
// Параметры:
//		Сотрудник - справочник гхб_ФизическиеЛица
//
Функция ВернутьДоступныеТипыАвтомобилейДляСотрудника(_Сотрудник) Экспорт
	
	_Массив = Новый Массив();
	
	Если ЗначениеЗаполнено(_Сотрудник) Тогда
	
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_НастройкиВозможностиРедактированияПарковочныеМеста.СлужебныеАвтомобили КАК СлужебныеАвтомобили,
		               |	гхб_НастройкиВозможностиРедактированияПарковочныеМеста.ПерсональныеАвтомобили КАК ПерсональныеАвтомобили
		               |ИЗ
		               |	РегистрСведений.гхб_НастройкиВозможностиРедактированияПарковочныеМеста КАК гхб_НастройкиВозможностиРедактированияПарковочныеМеста
		               |ГДЕ
		               |	гхб_НастройкиВозможностиРедактированияПарковочныеМеста.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Сотрудник", _Сотрудник);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если Выборка.ПерсональныеАвтомобили Тогда
				_Массив.Добавить(Перечисления.гхб_ТипАвтомобиляСлужебныйПерсональный.Персональный);
			КонецЕсли;
			
			Если Выборка.СлужебныеАвтомобили Тогда
				_Массив.Добавить(Перечисления.гхб_ТипАвтомобиляСлужебныйПерсональный.Служебный);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _Массив;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
